{
  "projects": [
    {
      "id": 1,
      "title": "DevPlay - Developer Playground",
      "shortDescription": "An open-source platform to explore, edit, and save reusable UI code components for projects.",
      "longDescription": "DevPlay is a full-stack open-source tool for developers to find and use ready-made UI components, animations, and transitions. It allows users to view multiple design styles for each component, edit the code using the Monaco Editor, and see live changes on the preview screen. Developers can save their edited code, manage different versions by renaming them, and access all saved codes in one place. An AI-powered feature also helps users apply bulk changes like background color or layout updates to speed up the development process.",
      "image": "https://t3.ftcdn.net/jpg/03/18/60/62/360_F_318606217_Hk8jo2MVoI33SQOkYrfOF929J7JgIP0P.jpg",
      "techStack": [
        "React",
        "Node.js",
        "Express.js",
        "MongoDB",
        "Monaco Editor",
        "Gemini API"
      ],
      "status": "Ongoing",
      "demoLink": "https://developer-playground.vercel.app/",
      "keyFeatures": [
        "Explore reusable UI components with different design styles.",
        "Edit code using the Monaco Editor and see live preview instantly.",
        "Save code snippets and manage different versions with smart naming.",
        "Access all your saved code in a dedicated dashboard.",
        "Use AI tools to make quick changes to design or layout.",
        "Secure login system using JWT for personalized code storage."
      ],
      "skillsUsed": [
        "React",
        "Node.js",
        "Express.js",
        "MongoDB",
        "Monaco Editor",
        "Frontend & Backend Development",
        "API Integration",
        "AI Integration"
      ]
    },
    {
      "id": 2,
      "title": "Sahayak - Women Support Platform",
      "shortDescription": "A platform for women to share security concerns, read helpful blogs, and access emergency support.",
      "longDescription": "Sahayak is a full-stack web platform built to support women by giving them a safe space to share security-related issues. Users can create posts to talk about their concerns, read others' posts to understand common problems, explore blogs that provide safety tips and awareness, and access helpline numbers for quick support. The platform aims to build a strong and informed community where women can raise their voice, support each other, and stay safe.",
      "image": "https://img.freepik.com/premium-vector/diverse-group-womens-hands-putting-together-teamwork-unity-concept_1323048-61227.jpg?semt=ais_hybrid",
      "techStack": [
        "React",
        "Node.js",
        "Express.js",
        "MongoDB"
      ],
      "status": "Completed",
      "demoLink": "https://hack-byte-indol.vercel.app/",
      "keyFeatures": [
        "Users can create posts to talk about their safety concerns.",
        "Read posts shared by other users to know about real-world issues.",
        "Explore blogs with useful tips and safety information.",
        "Quick access to verified emergency helpline numbers.",
        "JWT-based login for safe and secure access to features."
      ],
      "skillsUsed": [
        "React",
        "Node.js",
        "MongoDB",
        "Express.js",
        "Frontend & Backend Development"
      ]
    },
    {
      "id": 3,
      "title": "Real-Time Two-Way Live Video Streaming Web App",
      "shortDescription": "A web app for creating or joining video rooms with real-time audio/video communication and controls.",
      "longDescription": "This web app allows users to join or create live video rooms using a unique Room ID. If a room with the entered ID exists, the user is added to it; if not, a new room is created automatically. Users can see their own video stream and the other participant’s stream in real time. The app includes buttons to mute or unmute the microphone, turn the camera on or off, and leave the call. When a user joins or leaves a room, all participants are notified in real time.",
      "image": "https://media.istockphoto.com/id/1325416680/vector/two-people-online-video-laptop-call-business-meeting-at-work.jpg?s=612x612&w=0&k=20&c=w-Y9-181SWHRfvOtjStU33NrV5NTqyh7ptIjOSnJXjo=",
      "techStack": [
        "React",
        "Node.js",
        "Socket.IO",
        "WebRTC",
        "Express.js"
      ],
      "status": "Completed",
      "demoLink": "https://real-time-two-way-live-video-stream.vercel.app/",
      "keyFeatures": [
        "Join or create a room using a unique Room ID.",
        "Automatic room creation if the room ID doesn't exist.",
        "Live video and audio streaming between users.",
        "Mute/unmute microphone and toggle camera on/off.",
        "Leave call button with instant disconnect functionality.",
        "Real-time notifications when a user joins or leaves the room."
      ],
      "skillsUsed": [
        "React",
        "Node.js",
        "WebRTC",
        "Socket.IO",
        "Real-Time Communication",
        "Frontend & Backend Development"
      ]
    },
    {
      "id": 4,
      "title": "Web Scheduler App",
      "shortDescription": "A web app to create and manage daily schedules with task-level control and real-time progress tracking.",
      "longDescription": "This scheduler app allows users to create daily schedules and add multiple tasks under each one. Each task can be marked as complete, edited, or deleted individually. A progress bar tracks the completion status of each schedule and updates automatically as tasks are completed or removed. The app also features smart automation: when all tasks in a schedule are completed, the schedule is moved to the 'Completed Schedules' section; when all tasks are deleted, the entire schedule is auto-deleted. It’s built using Python, Django, HTML, CSS, and JavaScript.",
      "image": "https://static.vecteezy.com/system/resources/previews/035/263/099/non_2x/tasks-scheduling-on-a-week-flat-style-illustration-design-free-vector.jpg",
      "techStack": [
        "Python",
        "Django",
        "HTML",
        "CSS",
        "JavaScript"
      ],
      "status": "Completed",
      "keyFeatures": [
        "Create and manage daily schedules with multiple tasks.",
        "Mark tasks as completed, edit or delete them individually.",
        "Dynamic progress bar updates based on task status.",
        "Auto-completes a schedule when all tasks are completed.",
        "Auto-deletes a schedule if all tasks are deleted.",
        "View completed schedules in a separate section for tracking."
      ],
      "skillsUsed": [
        "Python",
        "Django",
        "HTML",
        "CSS",
        "JavaScript",
        "Web Development",
        "Task Management Logic"
      ]
    },
    {
      "id": 5,
      "title": "University Management System",
      "shortDescription": "A simple React-based app to manage student data with validation and local storage support.",
      "longDescription": "This university management system is a frontend-based project built using React and localStorage. It allows users to add, search, update, and delete student records. Each student is uniquely identified by their roll number, and the app includes validation checks to prevent duplicate roll numbers and incorrect phone numbers. All student data is stored in the browser using localStorage, making it lightweight and easy to use without any backend setup.",
      "image": "https://media.istockphoto.com/id/1188321657/vector/school-icon-vector-male-group-of-students-person-profile-avatar-with-mortar-board-hat-symbol.jpg?s=170667a&w=0&k=20&c=7yQ7gFJaKiTQwXHRyPFtdNE8xqXPyvChLxvoVnywytw=",
      "techStack": [
        "React",
        "JavaScript",
        "HTML",
        "CSS",
        "LocalStorage"
      ],
      "status": "Completed",
      "demoLink": "https://bhoomi3122.github.io/CampusRecords-Student-Records-Management-Platform---React-App/",
      "keyFeatures": [
        "Add new students with unique roll numbers.",
        "Search and filter student details quickly.",
        "Edit or delete existing student records.",
        "Validation checks for duplicate roll numbers and phone numbers.",
        "All data is stored locally using browser localStorage.",
        "User-friendly interface for quick management of student data."
      ],
      "skillsUsed": [
        "React",
        "JavaScript",
        "HTML",
        "CSS",
        "Form Validation",
        "LocalStorage",
        "Frontend Development"
      ]
    }
  ]
}